// 一、编程题
// 61.计算从1到100临近两个整数的合并依次输出3(1+2),第二次输出5(2+3),最后一次输出199(99+100)
// var b=0
// for(var a=1;a<100;a++){
//     b=a+(a+1)
// }console.log(b)

// 62.把1-100之间的数字，10个数字为一组，在控制台打印出每组的和，例如，1-10的和为一组，输出来，11-20的和为一组输出来，依次类推
// var a=0,b=0,c=0,d=0,e=0,f=0,g=0,h=0,j=0,k=0;
// for(var i=1;i<=100;i++){
//     if(1<=i  && i<=10){a+=i}
//     if(11<=i && i<=20){b+=i}
//     if(21<=i && i<=30){c+=i}
//     if(31<=i && i<=40){d+=i}
//     if(41<=i && i<=50){e+=i}
//     if(51<=i && i<=60){f+=i}
//     if(61<=i && i<=70){g+=i}
//     if(71<=i && i<=80){h+=i}
//     if(81<=i && i<=90){j+=i}
//     if(91<=i && i<=100){k+=i}
// }console.log(a,b,c,d,e,f,g,h,j,k)
// 63.它从 1 计数到100 ，遇到3的倍数输出单词“ Flip”，遇到5的倍数就输出单词“Flop”，遇到即使 3 又是 5 的倍数时则输出单词“ FlipFlop” ，其余情况下输出当前数字
// for(var a=1;a<=100;a++){
//     if(a%3==0){console.log('Flip')}
//     if(a%5==0){console.log('FlipFlop')}
//     if(a%3==0 && a%5==0){console.log(a)}
// }

// 64. 将下列文字分成多行显示, 春眠不觉晓，处处闻啼鸟。 夜来风雨声，花落知多少。
// var a= `春眠不觉晓，
// 处处闻啼鸟。 
// 夜来风雨声，
// 花落知多少。`
// console.log(a)

// 65. 定义一个四位数，按逆序打印出各位数字。例如原数字为4321，应输出1234
// var a=1234
// b=a%10
// c=parseInt(a/10%10)
// d=parseInt(a/100%10)
// e=parseInt(a/1000%10)
// console.log(b*1000+c*100+d*10+e)

// 66.定义一个三位数，求各位数的总和是多少，在控制台输出
// var a=123
// b=a%10
// c=parseInt(a/10%10)
// d=parseInt(a/100%10)
// console.log(b+c+d)

// 67.计算1+1/4+1/9+….+1/400，并且在控制台输出结果
// var b=0
// for(var a=1;a<=20;a++){
//     b=b+1/(a*a)
// }console.log(b)
// 68. 计算1-100能被3整除，但是不能被5整除的数，在控制台打印出来，并且统计出个数
// for(var a=1;a<=100;a++){
//     var b=1
//     if(a%3==0 && a%5 !=0){
//         b++
//     }
// }console.log(a)

// 69.输出从2000年（含）到3000年（含）间的所有闰年
// for(var a=2000;a<=3000;a++){
//     if(a%4==0){
//         console.log(a)
//     }
// }

// 70.计算下列表达式的结果：，并写出详细步骤
//  var a = 10;
//  var b = 2;
//  a %=b;
// 1.console.log(0.1+.03)结果是什么，为什么
//0.013  遇见数字+
// console.log(a);  0  10/2=5余数为0
// console.log(b++);2   

// 二、简答题

// 1.console.log(0.1+.03)结果是什么，为什么
//  0.13   遇见数字为运算符加

// 2.怎么将一个小数，取小数点的后2位
// var a=22.22222
// console.log(a.toFixed(2))

// 3.什么是隐式类型转换，什么时候发生
//1. 转成string类型： +（字符串连接符） 
//2..转成number类型：++/--(自增自减运算符) + - * / %(算术运算符) > < >= <= == != === !=== (关系运算符)
//3. 转成boolean类型：!（逻辑非运算符）

// 4.类型转换时，Number和parseInt的区别是什么
//一个直接转数字，，，一个转数字为整数
