什么时候会出现 undefined？
1、变量没赋初始值

2、函数没有返回值

什么是数组？什么时候使用？如何创建数组？
new Array()和[]两种方式

任何时候

可以填写一个数字作为构造时的参数，比如

var arr = new Array(5)

如何获取和修改数组中的某一个值？
//读取 console.log(person.name) //修改 person.name = 'dong' //删除 delete person.age

什么是对象？什么时候使用？如何创建对象？
给变量等赋值用的

任何时候

有7种数据类型

如何读取和修改和删除对象中的值？
读取：console.log(名称[*])

删除：delete 名称.要删除的名称

什么是数据类型？干什么用的？有几种数据类型？
变量

给变量等赋值用的

Number 数字类型
String 字符串类型
Boolean 布尔类型
Function 函数
Object 对象
Null
Boolean 类型有几个值？分别代表什么？
Boolean类型有两个值，true(真) , false（假）

什么时候使用字符串类型？
当所赋值中含有字母，汉字，符号时用字符串类型

为变量起名有什么要求？
不能以数字开头，名字只能包含数字，字母，下划线。不能是一些已被占用的关键字

如何定义常量？常量命名规范?
const 常量名 = 值

命名规范：不能以数字开头，名字只能包含数字，字母，下划线。不能是一些已被占用的关键字，推荐每个字母都用大写。中文不推荐使用

如何定义多行字符串？有几种方法？
1.每一行的最后加 \ 来定义多行字符串。

2.用 `` 例如：var lian = ' ... '