// 分析以下需求并实现
// 1.定义一个用于存放班级分数的数组var score = [80,90,85,90,78,88,89,93,98,75];
// 2.求出班级(分数低于60分的就是不及格) ?? 
// 3.求出班级的平均分
// 4.求出班级的总分数
// 定义一个数组
var  score = [80,90,85,90,78,88,89,93,98,75];
// 定义一个空数组
var newArr = [];
// 声明一个变量为newArray的索引
var j = 0;
// 遍历数组
var a=0
for (var i = 0; i < score.length; i++) {
         a+=score[i]
     // 筛除数组中大于60的数
     if (score[i] <= 60) {
         
         // 新数组索引号应该从0开始
         newArr[j] = score[i];
         // 索引递增
         j++;
      }
}
console.log('不及格人数'+newArr,'平均分'+a/score.length,'总分数'+a);