// 需求: 利用JavaScript完成输出如下图形（由“空格”和“*”这两种符号组成）
//     *********
//    *******
//   *****
//  ***      
// *  

// 分析: 5个空格     5 4 3 2 1 
//                  9 7 5 3 1



//1.因为重复代码重复了5次
// for (var k = 1; k <= 5; k++) {
//     var str = "";
//     // i: 5 4 3 2 1
//     for (var i = 1; i <= 5 - k; i++) {
//         str += " ";
//     }
//     // j: 9 7 5 3 1    (1 3 5 7 9  2n+1)  -(2n+1)+9
//     for (var j = 0; j <= -(2 * k + 1) + 9; j++) {
//         str += "*";
//     }
//     console.log(str);
// }
for(var i=0;i<5;i++)
{
    var b=''

for(var j=0;j<5-i;j++)
{
    b+=' '
}
for(var k=0;k<=-(2*i +1)+9;k++)
{
    b+='*' 
}console.log(b);

}