//28.鸡兔同笼：鸡和兔子一共35只，笼子里一共有94只脚，用程序计算出鸡和兔子分别多少只
// for (var a=1;a<100;a++){
//     for (var b=1; b<100;b++){
//         if(a+b==35 && 2*a+4*b==94){
//             console.log(a,b)
//         }
//     }
// }
//29.一个数如果恰好等于它的因子之和，这个数就称为 "完数 "。 例如6=1＋2＋3.编程 找出1000以内的所有完数。
 
// for (var a=1;a<1000;a++){
//     var c=0
//     for (var b=1;b<a;b++){
//         if(a%b==0){
//             c+=b
//         }       
//     }if (c==a)
//         {
//             console.log(c)
//         }
// }

// for (var a=1;a<1000;a++)
// {   var c=0
//     for(var b=1;b<a;b++)
//     {
//          if(a%b==0)
//          {
//              c+=b
//             }
         
             
//     }
//     if(c==a)
//          {
//              console.log(c)
//          }
// }
// for(var i=1;i<=9;i++){
//     for(var j=1;j<=i;j++){
//         console.log(i+"*"+j+"="+i*j);
//     }
// }

// for(var i=100;i>0;i--)
// console.log(i)

//本金10000存银行，年利率千分之三每过一年将本金和利息作为下一年的本金计算5年后有多少
