//吐血ing......
// 19. 录入一个三位数，按逆序打印出各位数字。例如原数字为321，应输出123
// var n=123
// a = n % 10;
// c = (n % 100)-a ;  
// b = n - (n %100);
// var m = a*100 + c + b/100;
// console.log(m)
// 20.	请编写程序，要求输入身高，体重后，输出体质指数
//     测量一个人的体质指数，体质指数（BMI）=体重（kg）÷身高^2（m），
//     成人的BMI数值：
//     过轻：低于18.5
//     正常：[18.5,23.9]
//     过重：[24,27]
//     肥胖：[28,32]
//     非常肥胖, 高于32
// var a=1.8
// var b=50,c
// if (c=b/(a^2)){
//      if (c<18.5){
//     console.log('过轻')
// }   if (c>=18.5 && c<=23.9){
//     console.log('正常')
// }   if (c>=24 && c<=27){
//     console.log('过重')
// }   if (c>=28 && c<=32){
//     console.log('肥胖')
// }   if (c>32){
//     console.log('非常肥胖')
// }
// }21.	录入月份，输出对应的季节
// (1)键盘录入一个整数(代表月份,范围1-12)
// (2)输出该月份对应的季节
//       3,4,5春季
//       6,7,8夏季
//       9,10,11秋季
//       12,1,2冬季
// (3)演示格式如下:
//       请输入一个月份:3
//       控制台输出:3月份是春季"
// var a=12
// if (a>=3 && a<=5){console.log(a+'月份是春季')}
// else if (a>=6 && a<=8){console.log(a+'月份是夏季')}
// else if (a>=9 && a<=11){console.log(a+'月份是秋季')}
// else if (a==12 || a==2 || a==1 ){console.log(a+'月份是冬季')}
// 22. 录入一个5位数,判断 该五位数是否为回文数。（判断第一位和第五位是否一样，第二位和第四位是否一样）
// var n=12321
// a = n % 10;
// b  = (n % 100)-a ;  
// c = n - (n %100);
// d = parseInt(n/1000%10);
// e = parseInt(n/10000%10);
// if (a==e||b==d){console.log('回文数')}
// else{console.log('不是回文数')}
// 23. 利用JavaScript完成如下功能：如果今天是星期六，那么1000天后是星期几 
// var a=1000%7
//     if(a==0){console.log('星期六')}
//     if(a==1){console.log('星期天')}
//     if(a==2){console.log('星期一')}
//     if(a==3){console.log('星期二')}
//     if(a==4){console.log('星期三')}
//     if(a==5){console.log('星期四')}
//     if(a==6){console.log('星期五')}



// 24.一个加油站为了鼓励车主多加油，所以加的多有优惠。
//       92号汽油，每升6元；如果大于20升，那么超出部分每升5.9；
//       95号汽油，每升7元；如果大于30升，那么超出部分每升6.95
//       编写JS程序，用户输入自己的汽油编号，然后输入自己加多少升，弹出价格。
//  var a=95
// var b=50
//      if(a==92 && b<=20){b=6*b 
// console.log(b)}
//    else if(a==95 && b<=30){b=6*b 
//         console.log(b)}
//      else if(a==92 && b>20){b=6*b  
//         console.log(b)}
//     else if(a==95 && b>30){b=6*b 
//         console.log(b)}
// 25. 收先接收用户输入的用户b=6*b 名，判断该用户名是否是admin,如果不是直接程序终止，如果是那么再次提示让用户输入密码,如果密码是88888,那么提示登录成功，否则提示登录失败
// var a=admin
// if (a==admin){console.log('输入密码')}
// else{console.log('输入错误')}
// var b=88888
// if (a==88888){console.log('登录成功')}
// else{console.log('输入错误')}
// 26. 100以内7的倍数的总和
// var f=0
// for (var i=1;i<100;i++)
// if (i%7==0){f+=i}
// console.log(f)

// 27.求1!+2!+3!+...+10!的和
// var a=1
// var sum =0
// for(var i=1;i<=10;i++){
//     a+=i
//     1!=1
//     2!=1*2 = 2=1！*2
//     3!=1*2*3 = 6=2！*3
//     4!=1*2*3*4 = 32=3！*4
//     sum=sum+a
// }
// console.log(sum)
// 28.鸡兔同笼：鸡和兔子一共35只，笼子里一共有94只脚，用程序计算出鸡和兔子分别多少只
// for(var j = 1; j<=35;j++){
//     for(var i = 1;i <=35;i++){

//         if(j*2+i*4 == 94){
//             console.log('鸡有:'+j+'兔有:'+i)
//         }
//     }
// }

// 29.一个数如果恰好等于它的因子之和，这个数就称为 "完数 "。 例如6=1＋2＋3.编程 找出1000以内的所有完数。
// var num = 0 
// for (var a=1;a<1000;a++){
//      for(var b=1;b<1000;b++){
//         if(a%b == 0 && a != b ){
//             num = b + num
//             if(a==num && a/2 == b  ){
//                 console.log(a);
//         }
      
            
//         }
//        }
//  }


// 30.输出2-200之间的所有素数（素数就是只能被1和其本身整除的数）`
// for (var i = 2; i < 200; i++) {`
//     var b = false;
//     for (var k = 2; k < i; k++) {
//         if (i % k == 0) {
//             b = true;
//         }
//     }
//     if (!b) {
//         console.log(i);
//     }
// }


// 31.解释：例如101中没有3；103中有一个3；133中有两个3。你要做的是统计出101到200之间的整数一共有多少个3。
// var num =0
// for (var n = 101; n< 200; n++){
//     var a= parseInt (n%10)
//     var b= parseInt (n/10%10)
//     if(a==3)
//     num +=1
//     else if(a==3 && b==3)
//     num+=2
// }console.log(num)

// 32.某同学参加计算机大赛：
// 		如果获得第1名，将参加清华大学组织的1个月夏令营；
// 		如果或得第2名，将奖励联想笔记本电脑一部；
// 		如果获得第3名，将奖励移动硬盘一个；
// 否则没有任何奖励；
// var num = 4
// if(num == 1){
//     console.log('将参加清华大学组织的1个月夏令营')
// }else if(num == 2){
//     console.log('奖励联想笔记本电脑一部')
// }else if(num == 3){
//     console.log(num+'奖励移动硬盘一个')
// }else{
//     console.log('否则没有任何奖励')
// }
// 33.利用JavaScript完成如下功能：要求在1~1000数字之中，找出所有能被5整除，或者被6整除的数字，并在控制台输出这些数字
// for (i=1;i<=1000;i++){
//     if(i%5==0||i%6==0){console.log(i)}
// }

// 34.求任意一个数字的约数有哪些
// var a = 40 
// for (b=1 ;b<=a ;b++)
//  if(a%b==0) {console.log(b)}
// 35.1-100之间所有数的总和 与 平均值
// var a=0
// for (i=1;i<=100;i++){
//     a=a+i
// }
// console.log(a/100)

// 36.求1~100以内(包含1和100)能同时被3，5整除的数的和，并将求出的和打印到控制台上.
// for (i=1;i<=100;i++){
//     if(i%3==0&&i%5==0){a+=i}}
//     console.log(a)

// 37.要求：圆的面积小于50，请打印出所有符合面积要求的整数半径。
// for (var a=1;a<100;a++){
//     if (a*a*3.14<=50){
//         console.log(`${a}`)
//     }
// }
// 38.遍历1到100之间（包含1和100）的所有数字，统计能被5整除的偶数的个数，最后将个数打印在控制台
// var a =0
// for (i=1;i<=100;i++){
//     if(i%5==0&&i%2==0){a++}
// }
//console.log(a)
