//输入某年，某月，某日，判断这一天是一年中的第几天
   
        var y =2015
        var m = 11
        var d =11
    //月
    //求各月份数字之和
        var he=[31,28,31,30,31,30,31,31,30,31,30];
        var sum=0;
        for(i = 0 ; i < m-1 ; i++){
            sum+=he[i]
        }
    //年
    //判断年是否为闰年，是且大于2月份加一
        if((y % 400 == 0 || (y % 4 == 0&& y%100 !=0)) && m > 2){
            summ = sum + d + 1;
            console.log("该天为一年中的第"+summ+"天");
        }else{
            summ = sum + d;
            console.log("该天为一年中的第"+summ+"天");
        }