// //1. 1-100之间所有数的总和 与 平均值
// var sum = 0
// var count = 0
// for (var i = 1; i <= 100; i++) {
//     sum=sum+i
//     count=sum/100
//     }

// console.log(sum)
// console.log(count)

// //2. 1-100之间所有偶数的和
// var sum = 0
// for (var i = 1; i <= 100; i++) {
//     if (i % 2 == 0 ) {
//         sum = sum + i

//     }
// }
// console.log(sum)

// //3. 100以内7的倍数的总和
// var sum = 0
// for (var i = 1; i <= 100; i++) {
//     if (i % 7 == 0 ) {
//         sum = sum + i

//     }
// }
// console.log(sum)

// //4. 利用JavaScript完成如下九九乘法表
// var sum=''
// for(var i = 1;i <= 9;i ++){          
//     for(var j = 1;j <= i;j ++){
//         sum +=i+'x'+j+'='+ i * j+'\t'
//     }sum  +='\n' 
// }    console.log(sum);        

// //5. 用户输入一个数字，列出所有它能够整除的数字。
// var a=52
// for(var i=1;i<=a;i++)
// {
//     if(a%i==0)
//     {
//         console.log(i)
//     }
// }

// // 6. 利用JavaScript求：1+2+3+…+100的和
// var a=0
// for(var i=1;i<=100;i++)
// {
//     a+=i
// }
// console.log(a)

// // 7. 利用JavaScript完成如下功能：要求在1~1000数字之中，找出所有能被5整除，或者被6整除的数字，并在控制台输出这些数字
// for (var i=1;i<=1000;i++)
// {
//     if(i%5==0 || i%6==0)
//     {
//         console.log(i)
//     }
// }
// // 8. 打印一个 5行4列的矩形

// //         9. 利用JavaScript完成输出如下图形（由“空格”和“*”这两种符号组成）（拔高题）
// //         * 
// //        * * 
// //       * * * 
// //      * * * * 
// //     * * * * * 
// var a='';
// for(var j=1;j<=8;j++){

// for(var j=1;j<=8;j++){
//     for(var i=1;i<=j;i++){

//         a=a+'*'+' '
//     }
//     a+='\n'
// }}
// console.log(' '+a)
// //已尽力

// // 10. 利用JavaScript，使用循环语句输出如下菱形图案（由“-”和“*”这两种符号组成） （拔高题）

// //      ---*
// //      --***
// //      -*****
// //      *******
// //      -*****
// //      --***
// //      ---*



// // var a = `           ---*
// //            --***
// //            -*****
// //            *******
// //            -*****
// //            --***
// //               *`
// //     console.log(a)

// // 11.利用JavaScript完成输出如下图形（由“空格”和“*”这两种符号组成）
// //      55555
// //      4444
// //      333
// //      22
// //      1
// //      22
// //      333
// //      4444
// //      55555



// // 12.利用JavaScript完成输出如下图形（由“空格”和“*”这两种符号组成）
// //      *                      *********
// //      ***                   *******
// //      *****                *****
// //      *******             ***      
// //      *********          *  
// var c='';
// for(var s=1;s<=10;s++){
//     for(var d=s;d<=10;d++){
//         c+='*'+' '
//     }
//     c+='\n'
// }
// console.log(c)


// var a='';
// for(var j=1;j<=10;j++){
//     for(var i=1;i<=j;i++){

//         a=a+'*'+' '
//     }
//     a+='\n'
// }
// console.log(a)










