/// 36.找出一个数组中有哪些重复元素，并且这些元素各重复了几次,var arr = [0,1,3,1,1,5,5,8,8,8,0,9,5]



// 分析:
// 1.声明一个空对象
var obj = {};
// 2.遍历数组
var arr = [0, 1, 3, 1, 1, 5, 5, 8, 8, 8, 0, 9, 5]
for (var i = 0; i < arr.length; i++) {
    // 3.判断数组中的某个数在不在对象中

    if (obj[arr[i]]) {
        // 3.1 如果在 那么直接让对象[键]++;
        obj[arr[i]]++;
    } else {
        // 3.2 如果不在 让该数组的元素作为对象的键 让次数直接赋值为1
        obj[arr[i]] = 1;
    }
}

// 4.打印结果
 

// 扩展性的 
// 5.如果有需要 那么可以遍历对象
 for (var key in obj) {
     console.log("键" + key + "出现了" + obj[key] + "次");
 }